In [1]:
import pandas as pd
import numpy as np

Pandas is a python library used for dat manipulation & analysis. It provides powerful, flexible tools to clean, explore and prepare data

### Creating a series

A series is a one dimensional array capable of holding any data type (integers,strings,floats,python objects)

In [434]:
# from a list

S1=pd.Series([10,20,"a",40])
print(S1)

0    10
1    20
2     a
3    40
dtype: object

In [435]:
# from a list with custom index

S2=pd.Series([10,True,30,40],index=['a','b','c','d'])
print(S2)

a      10
b    True
c      30
d      40
dtype: object

In [4]:
# from a dictionary

S3=pd.Series({'a':10,'b':20,'c':30})
print(S3)

a    10
b    20
c    30
dtype: int64

In [6]:
# from a scalar value

S4=pd.Series(5,index=[0,2,4,6])
print(S4)

0    5
2    5
4    5
6    5
dtype: int64

# Dataframe

In [436]:
# creation of a dataframe from a dictionary

data = {
    'Name' : ['Alice','Bob','Charlie'],
    'Age' : [25,30,35],
    'Salary' : [50000,60000,70000]
}

df=pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

#### Dataframe attributes

In [438]:
# 1) .index - shows the row labels

df.index

RangeIndex(start=0, stop=3, step=1)

In [23]:
# to change the index

df.index = ["a","b","c"]
df.index

Index(['a', 'b', 'c'], dtype='object')

In [14]:
# 2) ,columns - shows the column names

df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [17]:
# 3) .dtypes - shows data types of each columns

df.dtypes

Name      object
Age        int64
Salary     int64
dtype: object

In [443]:
df.dtypes["Age"]  # To find the type of a particular column

#df["Age"].dtypes - Another way

dtype('int64')

#### Replacing values: .replace()

The replace() method in pandas is used to substitute specifuc values in a dataframe or series with a new one

Syntax: Dataframe.replace(to_replace value, value to replaced with)

In [3]:
df= pd.DataFrame({
    "name": ["Alice","Bob","Charlie","Dave"],
    "gender": ["F","M","M","Unknown"],
    "Score": [-1,90,-1,95]    
})

print(df)

      name   gender  Score
0    Alice        F     -1
1      Bob        M     90
2  Charlie        M     -1
3     Dave  Unknown     95

In [4]:
# 1) Replace a single value

df['Score']=df['Score'].replace(-1,0)
df

      name   gender  Score
0    Alice        F      0
1      Bob        M     90
2  Charlie        M      0
3     Dave  Unknown     95

In [27]:
# 2) Replace multiple values (with one)

df['gender']=df['gender'].replace(["F","M"],"Known")
df

      name   gender  Score
0    Alice    Known     85
1      Bob    Known     90
2  Charlie    Known      0
3     Dave  Unknown     95

In [28]:
# 3) Replaces multiple values (with different values)

df= pd.DataFrame({
    "name": ["Alice","Bob","Charlie","Dave"],
    "gender": ["F","M","M","Unknown"],
    "Score": [85,90,-1,95]    
})

df['gender']=df['gender'].replace({"F":"Female","M":"Male"})
df

      name   gender  Score
0    Alice   Female     85
1      Bob     Male     90
2  Charlie     Male     -1
3     Dave  Unknown     95

In [29]:
# 4) using regex with replace

df["name"] = df["name"].replace(r'^A.*', 'NamestartwithA',regex=True)
df

             name   gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Unknown     95

In [31]:
# 5) Replace across entire dataframe

df = df.replace("Unknown","Missing")
df

             name   gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Missing     95

#### Rename method - .rename() - Renaming columns

In [32]:
df

             name   gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Missing     95

In [33]:
df_renamed = df.rename(columns = {"name":"Name","gender":"Gender"})
df_renamed

             Name   Gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Missing     95

In [34]:
df

             name   gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Missing     95

In [35]:
df.rename(columns = {"name":"Name","gender":"Gender"},inplace=True)
df

             Name   Gender  Score
0  NamestartwithA   Female     85
1             Bob     Male     90
2         Charlie     Male     -1
3            Dave  Missing     95

## Importing a CSV file to create a dataframe

In [36]:
import os

In [38]:
os.listdir()

['.ipynb_checkpoints',
 'Basic.ipynb',
 'Classwork-Numpy.ipynb',
 'Classwork-Pandas.ipynb',
 'customers-1000.csv',
 'Exercise.ipynb',
 'freecodecamp.ipynb',
 'freecodecampDS2.ipynb',
 'freecodecampNumpyPandas.ipynb',
 'laptop_price.csv',
 'laptop_price2.csv',
 'mypythonWorkbook.ipynb',
 'My_Module.ipynb',
 'My_Module.py',
 'my_text_file.txt',
 'New Folder',
 'Notes & Problems.ipynb',
 'players_20.csv',
 'Project_Web_Scraping_using_Pandas.ipynb',
 'Test.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Untitled7.ipynb',
 '__pycache__']

In [40]:
DF = pd.read_csv("laptop_price2.csv")
DF

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
0,1,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,1.37kg,1339.69
1,2,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,898.94
2,3,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,575.00
3,4,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,1.83kg,2537.45
4,5,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,1.37kg,1803.60
...,...,...,...,...,...,...,...,...,...,...,...,...,...
94,96,Asus,Zenbook UX430UA,Ultrabook,14.0,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,256GB SSD,Intel HD Graphics 620,Windows 10,1.25kg,1049.00
95,97,Acer,Spin 5,2 in 1 Convertible,13.3,IPS Panel Full HD / Touchscreen 1920x1080,Intel Core i5 8250U 1.6GHz,8GB,256GB SSD,Intel UHD Graphics 620,Windows 10,1.5kg,847.00
96,98,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,1TB HDD,AMD Radeon R5 M430,Linux,2.2kg,599.90
97,99,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i3 6006U 2GHz,4GB,256GB SSD,AMD Radeon R5 M430,Linux,2.2kg,485.00
98,100,Asus,X541UV-DM1439T (i3-7100U/6GB/256GB/GeForce,Notebook,15.6,Full HD 1920x1080,Intel Core i3 7100U 2.4GHz,6GB,256GB SSD,Nvidia GeForce 920M,Windows 10,2kg,577.00

In [60]:
DF.head()  # gives first 5 rows by default

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
0,1,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,1.37kg,1339.69
1,2,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,898.94
2,3,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,575.00
3,4,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,1.83kg,2537.45
4,5,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,1.37kg,1803.60

In [59]:
DF.tail()  # gives last 5 rows by default

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
94,96,Asus,Zenbook UX430UA,Ultrabook,14.0,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,256GB SSD,Intel HD Graphics 620,Windows 10,1.25kg,1049.0
95,97,Acer,Spin 5,2 in 1 Convertible,13.3,IPS Panel Full HD / Touchscreen 1920x1080,Intel Core i5 8250U 1.6GHz,8GB,256GB SSD,Intel UHD Graphics 620,Windows 10,1.5kg,847.0
96,98,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,1TB HDD,AMD Radeon R5 M430,Linux,2.2kg,599.9
97,99,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i3 6006U 2GHz,4GB,256GB SSD,AMD Radeon R5 M430,Linux,2.2kg,485.0
98,100,Asus,X541UV-DM1439T (i3-7100U/6GB/256GB/GeForce,Notebook,15.6,Full HD 1920x1080,Intel Core i3 7100U 2.4GHz,6GB,256GB SSD,Nvidia GeForce 920M,Windows 10,2kg,577.0

In [58]:
DF.head(10) # gives first 10 rows

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
0,1,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,1.37kg,1339.69
1,2,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,898.94
2,3,HP,250 G6,Notebook,15.6,Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,1.86kg,575.00
3,4,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,1.83kg,2537.45
4,5,Apple,MacBook Pro,Ultrabook,13.3,IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,1.37kg,1803.60
5,6,Acer,Aspire 3,Notebook,15.6,1366x768,AMD A9-Series 9420 3GHz,4GB,500GB HDD,AMD Radeon R5,Windows 10,2.1kg,400.00
6,7,Apple,MacBook Pro,Ultrabook,15.4,IPS Panel Retina Display 2880x1800,Intel Core i7 2.2GHz,16GB,256GB Flash Storage,Intel Iris Pro Graphics,Mac OS X,2.04kg,2139.97
7,8,Apple,Macbook Air,Ultrabook,13.3,1440x900,Intel Core i5 1.8GHz,8GB,256GB Flash Storage,Intel HD Graphics 6000,macOS,1.34kg,1158.70
8,9,Asus,ZenBook UX430UN,Ultrabook,14.0,Full HD 1920x1080,Intel Core i7 8550U 1.8GHz,16GB,512GB SSD,Nvidia GeForce MX150,Windows 10,1.3kg,1495.00
9,10,Acer,Swift 3,Ultrabook,14.0,IPS Panel Full HD 1920x1080,Intel Core i5 8250U 1.6GHz,8GB,256GB SSD,Intel UHD Graphics 620,Windows 10,1.6kg,770.00

In [57]:
DF.tail(10)  # gives last 10 rows

,laptop_ID,Company,Product,TypeName,Inches,ScreenResolution,Cpu,Ram,Memory,Gpu,OpSys,Weight,Price_euros
89,91,Dell,XPS 13,Ultrabook,13.3,IPS Panel Full HD 1920x1080,Intel Core i7 8550U 1.8GHz,8GB,256GB SSD,Intel UHD Graphics 620,Windows 10,1.21kg,1649.0
90,92,Asus,FX550IK-DM018T (FX-9830P/8GB/1TB/Radeon,Gaming,15.6,Full HD 1920x1080,AMD FX 9830P 3GHz,8GB,1TB HDD,AMD Radeon RX 560,Windows 10,2.45kg,699.0
91,93,Acer,Aspire 5,Notebook,15.6,Full HD 1920x1080,Intel Core i7 8550U 1.8GHz,8GB,1TB HDD,Nvidia GeForce MX150,Windows 10,2.2kg,689.0
92,94,HP,Probook 430,Notebook,13.3,Full HD 1920x1080,Intel Core i7 8550U 1.8GHz,16GB,512GB SSD,Intel UHD Graphics 620,Windows 10,1.49kg,1197.0
93,95,Dell,Inspiron 7577,Gaming,15.6,Full HD 1920x1080,Intel Core i5 7300HQ 2.5GHz,8GB,256GB SSD,Nvidia GeForce GTX 1060,Windows 10,2.65kg,1195.0
94,96,Asus,Zenbook UX430UA,Ultrabook,14.0,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,256GB SSD,Intel HD Graphics 620,Windows 10,1.25kg,1049.0
95,97,Acer,Spin 5,2 in 1 Convertible,13.3,IPS Panel Full HD / Touchscreen 1920x1080,Intel Core i5 8250U 1.6GHz,8GB,256GB SSD,Intel UHD Graphics 620,Windows 10,1.5kg,847.0
96,98,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i7 7500U 2.7GHz,8GB,1TB HDD,AMD Radeon R5 M430,Linux,2.2kg,599.9
97,99,Dell,Inspiron 3567,Notebook,15.6,Full HD 1920x1080,Intel Core i3 6006U 2GHz,4GB,256GB SSD,AMD Radeon R5 M430,Linux,2.2kg,485.0
98,100,Asus,X541UV-DM1439T (i3-7100U/6GB/256GB/GeForce,Notebook,15.6,Full HD 1920x1080,Intel Core i3 7100U 2.4GHz,6GB,256GB SSD,Nvidia GeForce 920M,Windows 10,2kg,577.0

In [56]:
DF.describe()  # gives basic statistical conclusions of columns

        laptop_ID     Inches  Price_euros
count   99.000000  99.000000    99.000000
mean    50.353535  15.041414   898.217071
std     29.121951   1.394011   547.287985
min      1.000000  10.100000   191.900000
25%     25.500000  14.000000   486.845000
50%     50.000000  15.600000   819.000000
75%     75.500000  15.600000  1101.000000
max    100.000000  17.300000  2858.000000

In [55]:
DF.info()  # gives basic data type of columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   laptop_ID         99 non-null     int64
 1   Company           99 non-null     object
 2   Product           99 non-null     object
 3   TypeName          99 non-null     object
 4   Inches            99 non-null     float64
 5   ScreenResolution  99 non-null     object
 6   Cpu               99 non-null     object
 7   Ram               99 non-null     object
 8   Memory            99 non-null     object
 9   Gpu               99 non-null     object
 10  OpSys             99 non-null     object
 11  Weight            99 non-null     object
 12  Price_euros       99 non-null     float64
dtypes: float64(2), int64(1), object(10)
memory usage: 10.2+ KB

In [54]:
DF.shape # gives no of rows and columns

(99, 13)

In [61]:
DF.columns

Index(['laptop_ID', 'Company', 'Product', 'TypeName', 'Inches',
       'ScreenResolution', 'Cpu', 'Ram', 'Memory', 'Gpu', 'OpSys', 'Weight',
       'Price_euros'],
      dtype='object')

In [63]:
DF["Company"]

0     Apple
1     Apple
2        HP
3     Apple
4     Apple
      ...
94     Asus
95     Acer
96     Dell
97     Dell
98     Asus
Name: Company, Length: 99, dtype: object

In [67]:
DF["Price_euros"].min()  # gives minimum value of the column "Price_euros"

191.9

In [71]:
DF["Price_euros"].max()   # gives maximum value of the column "Price_euros"

2858.0

## Data Cleaning & Preprocessing

1) Handling missing data: isnull(), dropna(), fillna()

Handling missing data is a crucial part of data cleaning in data analytics and data science. Pandas provides powerful functions to detect, remove or fill in missing values

In [5]:
data = {
    "Name": ["Alice","Bob","CHarlie","David"],
    "Age": [25,np.nan,35,40],
    "City": ["New york","Paris",np.nan,"London"]
}

df = pd.DataFrame(data)
df

      Name   Age      City
0    Alice  25.0  New york
1      Bob   NaN     Paris
2  CHarlie  35.0       NaN
3    David  40.0    London

In [7]:
# 1) isnull() - detect missing values

# returns a dataframe of True/False indicating missing values(Nan)

df.isnull()

    Name    Age   City
0  False  False  False
1  False   True  False
2  False  False   True
3  False  False  False

In [80]:
# 2) dropna() - Remove missing data

# drop rows with any missing value

df.dropna()  # only creates a copy of the original dataframe

    Name   Age      City
0  Alice  25.0  New york
3  David  40.0    London

In [82]:
df.dropna(inplace = True) # overwrites the original dataframe
df

    Name   Age      City
0  Alice  25.0  New york
3  David  40.0    London

In [102]:
data = {
    "Name": ["Alice","Bob","CHarlie","David"],
    "Age": [25,np.nan,35,40],
    "City": ["New york","Paris",np.nan,"London"]
}

df = pd.DataFrame(data)
df

      Name   Age      City
0    Alice  25.0  New york
1      Bob   NaN     Paris
2  CHarlie  35.0       NaN
3    David  40.0    London

In [87]:
# drop columns with missing values

df.dropna(axis=1)

      Name
0    Alice
1      Bob
2  CHarlie
3    David

In [88]:
# 3) fillna() - fill missing values

# fill with a specific value

df.fillna(0)

      Name   Age      City
0    Alice  25.0  New york
1      Bob   0.0     Paris
2  CHarlie  35.0         0
3    David  40.0    London

In [89]:
# fill with string

df.fillna("Unknown")

      Name      Age      City
0    Alice     25.0  New york
1      Bob  Unknown     Paris
2  CHarlie     35.0   Unknown
3    David     40.0    London

In [98]:
# fill with column mean (for numerical columns)

df["Age"].fillna(df["Age"].mean(),inplace = True)
df

      Name        Age      City
0    Alice  25.000000  New york
1      Bob  33.333333     Paris
2  CHarlie  35.000000       NaN
3    David  40.000000    London

In [394]:
# forward fill (propagate previous value)

df.fillna(method="ffill")
#df.ffill()

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\2442242706.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

  Department Employee  Salary Gender  Join_date  Join_Year
0      Sales    Alice   50000      F 1996-12-25       1996
1      Sales      Bob   55000      M 2000-08-30       2000
2         HR  Charlie   40000      M 1996-06-21       1996
3         HR    David   42000      M 2024-09-01       2024
4         IT      Eve   60000      F 2024-12-05       2024
5         IT    Frank   62000      M 2010-07-15       2010

In [104]:
# backward fill

df.fillna(method = "bfill")

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\2457908838.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "bfill")

      Name   Age      City
0    Alice  25.0  New york
1      Bob  35.0     Paris
2  CHarlie  35.0    London
3    David  40.0    London

### Duplicates : duplicated(), drop_duplicates()

duplicated()

It identifies rows or specific columns values

In [11]:
df = pd.DataFrame({
    "A": [1,2,2,3,3,3],
    "B": ["a","b","b","c","d","c"]
})
df

   A  B
0  1  a
1  2  b
2  2  b
3  3  c
4  3  d
5  3  c

In [22]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [33]:
#df.duplicated(["A","B"]) # same as df.duplicated()
#df.duplicated(["A"])
df.duplicated(subset = ["B"])

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [24]:
df[df.duplicated()] # return a dataframe of all the duplcated removed rows

   A  B
2  2  b
5  3  c

In [25]:
df[df.duplicated(keep="last")]

   A  B
1  2  b
3  3  c

In [26]:
df[df.duplicated(keep=False)]

   A  B
1  2  b
2  2  b
3  3  c
5  3  c

drop_duplicates()

It removes duplicate rows (or based on specific columns)

A dataframe with duplicates dropped

In [27]:
df

   A  B
0  1  a
1  2  b
2  2  b
3  3  c
4  3  d
5  3  c

In [32]:
df.drop_duplicates()

   A  B
0  1  a
1  2  b
3  3  c
4  3  d

In [31]:
df.drop_duplicates(keep = "last")

   A  B
0  1  a
2  2  b
4  3  d
5  3  c

### Data Cleaning

In [36]:
df2 = pd.read_csv("Myfile.csv")
df2

FileNotFoundError: [Errno 2] No such file or directory: 'Myfile.csv'

In [125]:
df2.isnull()

    Sl No   Name    Age  Place
0   False  False  False  False
1   False  False  False  False
2   False  False   True  False
3   False  False  False  False
4   False  False   True  False
5   False  False  False  False
6   False  False  False  False
7   False  False  False  False
8   False  False  False  False
9   False  False   True  False
10  False  False  False  False
11  False  False  False  False
12  False  False   True  False
13  False  False  False  False
14  False  False  False  False

In [131]:
df2["Age"]= pd.to_numeric(df2["Age"],errors = "coerce")

In [132]:
df2["Age"]=df2["Age"].fillna(df2["Age"].mean())

In [35]:
df2 = df2.drop_duplicates(subset = "Name")
df2

NameError: name 'df2' is not defined

In [136]:
df3 = df2.drop_duplicates(subset = "Place")
df3

   Sl No    Name        Age     Place
0      1  Vishnu  25.000000       TVM
2      3    Ajay  28.272727      ERKM
4      5   Vijin  28.272727    Kollam
8      9    Abin  15.000000  Thrissur

In [139]:
# export to a new csv file

df2.to_csv("Myfile_cleaned.csv")

In [34]:
# export to a new excel file

df2.to_excel("Myfile_cleaned.xlsx")

NameError: name 'df2' is not defined

### Adding/removing columns & rows

In [140]:
df = pd.DataFrame({
    "A": [1,2,3],
    "B": ["a","b","c"]
})
df

   A  B
0  1  a
1  2  b
2  3  c

In [143]:
# Add a column with a single value

df["C"]= 10
df

   A  B   C
0  1  a  10
1  2  b  10
2  3  c  10

In [144]:
# Add a column from a list or series

df["D"]= [100,200,300]
df

   A  B   C    D
0  1  a  10  100
1  2  b  10  200
2  3  c  10  300

In [146]:
# Add a column based on existing columns

df["E"]= df["A"]*2
df

   A  B   C    D  E
0  1  a  10  100  2
1  2  b  10  200  4
2  3  c  10  300  6

### Sorting in a dataframe

1) sort_values()

sort the dataframe or series by one or more column values

In [149]:
df = pd.DataFrame({
    "Name": ["Ajay","Vishnu", "Anand","Irfan","Soorya"],
    "Age": [40,28,35,35,25],
    "Gender": ["Male","Male","Male","Male","Female"],
    "City": ["London","Manchester", "New York", "London", "Washington DC"]},
    index = [3,1,0,2,5]
)
df

     Name  Age  Gender           City
3    Ajay   40    Male         London
1  Vishnu   28    Male     Manchester
0   Anand   35    Male       New York
2   Irfan   35    Male         London
5  Soorya   25  Female  Washington DC

In [155]:
# sort by "Age"

df.sort_values(by = "Age")  # only creates a copy of the original dataframe

     Name  Age  Gender           City
5  Soorya   25  Female  Washington DC
1  Vishnu   28    Male     Manchester
2   Irfan   35    Male         London
0   Anand   35    Male       New York
3    Ajay   40    Male         London

In [151]:
df.sort_values(by = ["Age","Name"])

     Name  Age  Gender           City
5  Soorya   25  Female  Washington DC
1  Vishnu   28    Male     Manchester
0   Anand   35    Male       New York
2   Irfan   35    Male         London
3    Ajay   40    Male         London

sort_index()

sort the dataframe or series by the index (row or column labels)

In [156]:
# sort by index

df.sort_index()  # only creates a copy of the original dataframe

     Name  Age  Gender           City
0   Anand   35    Male       New York
1  Vishnu   28    Male     Manchester
2   Irfan   35    Male         London
3    Ajay   40    Male         London
5  Soorya   25  Female  Washington DC

### Filtering and Subsetting in Pandas

#### Selecting columns

In [160]:
# filtering by a single column

df["Gender"]

3      Male
1      Male
0      Male
2      Male
5    Female
Name: Gender, dtype: object

In [161]:
# filtering by multiple columns

df[["Gender","City"]]

   Gender           City
3    Male         London
1    Male     Manchester
0    Male       New York
2    Male         London
5  Female  Washington DC

#### Subsetting/filtering rows

In [164]:
# filter rows with single condition , age > 30

df[df["Age"]>30]

    Name  Age Gender      City
3   Ajay   40   Male    London
0  Anand   35   Male  New York
2  Irfan   35   Male    London

In [170]:
# filter rows with multiple conditions , age < 30 and Gender = Male

df[(df["Age"]<30) & (df["Gender"]=="Male")]

     Name  Age Gender        City
1  Vishnu   28   Male  Manchester

### Using loc and iloc for filtering and subsetting

In [171]:
df.loc[df["Age"]>30]

    Name  Age Gender      City
3   Ajay   40   Male    London
0  Anand   35   Male  New York
2  Irfan   35   Male    London

In [172]:
df.loc[df["Age"]>30,["Name","Gender"]]

    Name Gender
3   Ajay   Male
0  Anand   Male
2  Irfan   Male

In [175]:
df.loc[df["Age"]>30,"Name":"Gender"]

    Name  Age Gender
3   Ajay   40   Male
0  Anand   35   Male
2  Irfan   35   Male

In [176]:
df.iloc[0:3]  # first 3 rows

     Name  Age Gender        City
3    Ajay   40   Male      London
1  Vishnu   28   Male  Manchester
0   Anand   35   Male    New York

In [177]:
df.iloc[0:3,1:3]

   Age Gender
3   40   Male
1   28   Male
0   35   Male

### Filtering with .str methods (on string columns)

In [185]:
df[df["Name"].str.contains("hnu")]

     Name  Age Gender        City
1  Vishnu   28   Male  Manchester

In [180]:
df[df["Name"].str.startswith("A")]

    Name  Age Gender      City
3   Ajay   40   Male    London
0  Anand   35   Male  New York

In [181]:
df[df["Name"].str.endswith("n")]

    Name  Age Gender    City
2  Irfan   35   Male  London

### Filtering with .query() method

In [184]:
df.query("Age > 30 and Gender == 'Male'")

    Name  Age Gender      City
3   Ajay   40   Male    London
0  Anand   35   Male  New York
2  Irfan   35   Male    London

### Filtering with .isin()

In [191]:
df[df["City"].isin(["London","New York"])]

    Name  Age Gender      City
3   Ajay   40   Male    London
0  Anand   35   Male  New York
2  Irfan   35   Male    London

## Data transformation

Applying functions .apply(), .map() & applymap()

In [203]:
# 1)  .map() - for series only

# applies a function element wise to a pandas series

S = pd.Series([1,2,3,4])
S.map(lambda X: X*10)

0    10
1    20
2    30
3    40
dtype: int64

In [194]:
# 2) .apply() - for both series and dataframe

# applies a function to each element in the series

S = pd.Series([1,2,3,4])
S.apply(lambda X: X**2)

0     1
1     4
2     9
3    16
dtype: int64

In [195]:
# .apply() - applies the function along an axis (rows or columns)

df = pd.DataFrame({
    "A": [1,2,3],
    "B": [10,20,30]
})

# sum across columns

df.apply(lambda row: row["A"] + row["B"],axis =1)

0    11
1    22
2    33
dtype: int64

In [196]:
# apply to a column

df["A"].apply(lambda X: X+100)

0    101
1    102
2    103
Name: A, dtype: int64

In [198]:
# 3) .applymap() - for dataframes only

# applies a function element wise to every single cell in a dataframe

In [199]:
df

   A   B
0  1  10
1  2  20
2  3  30

In [200]:
# multiply every element by 2

df.applymap(lambda X: X*2)

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\2333727151.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda X: X*2)

   A   B
0  2  20
1  4  40
2  6  60

In [201]:
df

   A   B
0  1  10
1  2  20
2  3  30

## Aggregation and Grouping in Pandas - groupby()

groupby() function is one of the most powerful features in pandas. It allows you to split your data into groups, apply some function to each group, and then combine to results.

Syntax: df.groupby("column_name")

In [206]:
data = {
    "Department": ["Sales","Sales","HR","HR","IT","IT"],
    "Employee": ["Alice","Bob","Charlie","David","Eva","Frank"],
    "Salary": [50000,55000,60000,58000,75000,72000]
}
df= pd.DataFrame(data)
df

  Department Employee  Salary
0      Sales    Alice   50000
1      Sales      Bob   55000
2         HR  Charlie   60000
3         HR    David   58000
4         IT      Eva   75000
5         IT    Frank   72000

In [207]:
# group by a single column

grouped = df.groupby("Department")
print(grouped["Salary"].mean())

Department
HR       59000.0
IT       73500.0
Sales    52500.0
Name: Salary, dtype: float64

In [209]:
""" Commonly used functions:
mean() - average of each groups
sum() - sum of values of each group
count() - no of non null observations in each group
max()/min() - maximum/minimum value in each groups
std() - standard deviation
agg() - custom aggregation

"""

' Commonly used functions:\nmean() - average of each groups\nsum() - sum of values of each group\ncount() - no of non null observations in each group\nmax()/min() - maximum/minimum value in each groups\nstd() - standard deviation\nagg() - custom aggregation\n\n'

In [210]:
df.groupby("Department")["Salary"].sum()

Department
HR       118000
IT       147000
Sales    105000
Name: Salary, dtype: int64

In [213]:
# using of aggregation function

df.groupby("Department")["Salary"].agg(["mean","max","min"])

               mean    max    min
Department
HR          59000.0  60000  58000
IT          73500.0  75000  72000
Sales       52500.0  55000  50000

In [214]:
# group by multiple columns

df.groupby(["Department","Employee"])["Salary"].sum()

Department  Employee
HR          Charlie     60000
            David       58000
IT          Eva         75000
            Frank       72000
Sales       Alice       50000
            Bob         55000
Name: Salary, dtype: int64

In [225]:
df.groupby(["Department","Employee"])["Salary"].agg(["sum","mean"])

                       sum     mean
Department Employee
HR         Charlie   60000  60000.0
           David     58000  58000.0
IT         Eva       75000  75000.0
           Frank     72000  72000.0
Sales      Alice     50000  50000.0
           Bob       55000  55000.0

In [223]:
# using .agg() with custom functions

df.groupby("Department")["Salary"].agg(total_salary = "sum",average_salary = "mean",num_employees = "count")

            total_salary  average_salary  num_employees
Department
HR                118000         59000.0              2
IT                147000         73500.0              2
Sales             105000         52500.0              2

In [226]:
os.listdir()

['.ipynb_checkpoints',
 'Basic.ipynb',
 'Classwork-Numpy.ipynb',
 'Classwork-Pandas.ipynb',
 'Company_employees_salary.csv',
 'customers-1000.csv',
 'Exercise.ipynb',
 'freecodecamp.ipynb',
 'freecodecampDS2.ipynb',
 'freecodecampNumpyPandas.ipynb',
 'laptop_price.csv',
 'laptop_price2.csv',
 'Myfile.csv',
 'Myfile_cleaned.csv',
 'mypythonWorkbook.ipynb',
 'My_Module.ipynb',
 'My_Module.py',
 'my_text_file.txt',
 'New Folder',
 'Notes & Problems.ipynb',
 'players_20.csv',
 'Project_Web_Scraping_using_Pandas.ipynb',
 'Test.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb',
 'Untitled3.ipynb',
 'Untitled4.ipynb',
 'Untitled5.ipynb',
 'Untitled6.ipynb',
 'Untitled7.ipynb',
 '__pycache__']

In [229]:
df = pd.read_csv('Company_employees_salary.csv')
df
df.drop("Sl No",axis=1,inplace=True)
df

   Employee      Department  Salary
0    Vishnu      Facilities   30000
1     Rahul      Facilities   50000
2      Ajay              HR   40000
3     Anand           Sales   45000
4     Vijin              HR   30000
5     Navab              HR   35000
6    Janish  Administration   25000
7     Irfan  Administration   20000
8      Abin      Facilities   60000
9    Sandra           Sales   20000
10   Devika           Sales   45000
11   Soorya              HR   50000
12   Jithin  Administration   38000
13    Pooja        Software   75000
14    Akhil        Software   80000

In [231]:
df.groupby(["Department","Employee"])["Salary"].agg(["mean","max","min","count"])

                            mean    max    min  count
Department     Employee
Administration Irfan     20000.0  20000  20000      1
               Janish    25000.0  25000  25000      1
               Jithin    38000.0  38000  38000      1
Facilities     Abin      60000.0  60000  60000      1
               Rahul     50000.0  50000  50000      1
               Vishnu    30000.0  30000  30000      1
HR             Ajay      40000.0  40000  40000      1
               Navab     35000.0  35000  35000      1
               Soorya    50000.0  50000  50000      1
               Vijin     30000.0  30000  30000      1
Sales          Anand     45000.0  45000  45000      1
               Devika    45000.0  45000  45000      1
               Sandra    20000.0  20000  20000      1
Software       Akhil     80000.0  80000  80000      1
               Pooja     75000.0  75000  75000      1

In [280]:
df.groupby("Department")["Salary"].mean()

Department
Administration    27666.666667
Facilities        46666.666667
HR                38750.000000
Sales             36666.666667
Software          77500.000000
Name: Salary, dtype: float64

In [232]:
df.groupby(["Employee"])["Salary"].max()

Employee
Abin      60000
Ajay      40000
Akhil     80000
Anand     45000
Devika    45000
Irfan     20000
Janish    25000
Jithin    38000
Navab     35000
Pooja     75000
Rahul     50000
Sandra    20000
Soorya    50000
Vijin     30000
Vishnu    30000
Name: Salary, dtype: int64

In [235]:
df["Salary"].max()

80000

### Combining dataframes

concat(), merge(), join(), append()

In [236]:
# 1) concat() - concatenate dataframes along rows or columns stacking vertically or horizontally

"""
pd.concat([df1,df2])  # stack rows (axis = 0)
pd.concat([df1,df2],axis=1) # stack columns
"""

'\npd.concat([df1,df2])  # stack rows (axis = 0)\npd.concat([df1,df2],axis=1) # stack columns\n'

In [244]:
df1= pd.DataFrame({"A":[1,2],"B":[3,4]})
df2= pd.DataFrame({"A":[5,6],"B":[7,8]})
print(df1)
print(df2)

   A  B
0  1  3
1  2  4
   A  B
0  5  7
1  6  8

In [245]:
pd.concat([df1,df2])

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [241]:
pd.concat([df1,df2], axis = 1)

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [255]:
df3= pd.DataFrame({"A":[1,2],"B":[3,4]})
df4= pd.DataFrame({"C":[5,6],"D":[7,8]})

In [248]:
pd.concat([df3,df4])

     A    B    C    D
0  1.0  3.0  NaN  NaN
1  2.0  4.0  NaN  NaN
0  NaN  NaN  5.0  7.0
1  NaN  NaN  6.0  8.0

In [249]:
pd.concat([df3,df4],axis=1)

   A  B  C  D
0  1  3  5  7
1  2  4  6  8

In [250]:
df5= pd.DataFrame({"A":[1,2],"B":[3,4]})
df6= pd.DataFrame({"B":[5,6],"C":[7,8]})

In [251]:
pd.concat([df5,df6])

     A  B    C
0  1.0  3  NaN
1  2.0  4  NaN
0  NaN  5  7.0
1  NaN  6  8.0

In [252]:
pd.concat([df5,df6],axis=1)

   A  B  B  C
0  1  3  5  7
1  2  4  6  8

merge()

merge dataframes based on common columns(keys)

pd.merge(df1,df2,on="key") # inner join by default

pd.merge(df1,df2,how="left",on="key") # left join

pd.merge(df1,df2,how="outer",on="key") # full outer join

pd.merge(df1,df2,left_on="id1",right_on="id2") # different key names

In [263]:
df1 = pd.DataFrame({
    "Key":["A","B","C"],
    "value1":[1,2,3]
})

df2 = pd.DataFrame({
    "Key":["A","B","D"],
    "value2":[100,200,300]
})

df1

  Key  value1
0   A       1
1   B       2
2   C       3

In [266]:
r= pd.merge(df1,df2,on='Key')
print(r)

  Key  value1  value2
0   A       1     100
1   B       2     200

In [267]:
pd.merge(df1,df2,how="left",on="Key")

  Key  value1  value2
0   A       1   100.0
1   B       2   200.0
2   C       3     NaN

In [268]:
pd.merge(df2,df1,how="left",on="Key")

  Key  value2  value1
0   A     100     1.0
1   B     200     2.0
2   D     300     NaN

In [269]:
pd.merge(df1,df2,how="outer",on="Key")

  Key  value1  value2
0   A     1.0   100.0
1   B     2.0   200.0
2   C     3.0     NaN
3   D     NaN   300.0

In [270]:
pd.merge(df2,df1,how="outer",on="Key")

  Key  value2  value1
0   A   100.0     1.0
1   B   200.0     2.0
2   C     NaN     3.0
3   D   300.0     NaN

In [273]:
df1 = pd.DataFrame({"ID":[1,2],"Name":["Alice","Bob"]})
df2 = pd.DataFrame({"ID":[1,2],"Score":[90,85]})
pd.merge(df1,df2, on="ID")

   ID   Name  Score
0   1  Alice     90
1   2    Bob     85

In [274]:
df1 = pd.DataFrame({"ID":[1,2],"Name":["Alice","Bob"]})
df2 = pd.DataFrame({"ID":[1,3],"Score":[90,85]})
pd.merge(df1,df2, on="ID")

   ID   Name  Score
0   1  Alice     90

In [275]:
# join() - combine using index or keys - join columns of another dataframe using index or key column

# df1.join(df2) - join on index
# df1.join(df2.set_index("Key"), on ="Key") # join on key column

In [276]:
df1= pd.DataFrame({"Name":["Alice","Bob"]},index = [0,1])
df2 = pd.DataFrame({"Score":[85,90]}, index = [0,1])
df1.join(df2)

    Name  Score
0  Alice     85
1    Bob     90

In [277]:
# append() - add rows

# old way not supporting now - df1.append(df2)

# recommended - pd.concat([df1,df2])

In [278]:
df1 = pd.DataFrame({"A":[1,2],"B":[3,4]})
df2 = pd.DataFrame({"A":[5,6],"B":[7,8]})
res = pd.concat([df1,df2],ignore_index=True)
print(res)

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [284]:
# merge two dfs employee details and salary on employee ID

df1= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Department":["HR","Sales","HR"]})
df2 = pd.DataFrame({"ID": [1,2,3],"Salary":[50000,60000,40000]})
pd.merge(df1,df2,on="ID")

   ID   Name Department  Salary
0   1   Arun         HR   50000
1   2   Ajay      Sales   60000
2   3  Rahul         HR   40000

In [285]:
# filter rows where Age > 30 and Gender == Male

df = pd.DataFrame({"Name":["A","B","C","D","E"],"Age":[25,45,33,24,50],"Gender":["Male","Female","Male","Male","Female"]})
df

  Name  Age  Gender
0    A   25    Male
1    B   45  Female
2    C   33    Male
3    D   24    Male
4    E   50  Female

In [287]:
df[(df["Age"]>30) & (df["Gender"]=="Male")]

  Name  Age Gender
2    C   33   Male

In [288]:
# fill missing values in age with median age

df = pd.DataFrame({"Name":["A","B","C","D","E"],"Age":[25,np.nan,33,24,np.nan],"Gender":["Male","Female","Male","Male","Female"]})
df

  Name   Age  Gender
0    A  25.0    Male
1    B   NaN  Female
2    C  33.0    Male
3    D  24.0    Male
4    E   NaN  Female

In [291]:
Median_Age = df["Age"].median()
Median_Age

25.0

In [293]:
df["Age"] = df["Age"].fillna(Median_Age)
df

  Name   Age  Gender
0    A  25.0    Male
1    B  25.0  Female
2    C  33.0    Male
3    D  24.0    Male
4    E  25.0  Female

In [325]:
# apply a custom function to a column to categorize age into young,middle aged, senior

In [324]:
df = pd.DataFrame({"Name": ["A","B","C","D","E"],"Age": [25,40,50,75,35]})
def Age_Categorize(Age):
    if Age < 30:
        return "Young"
    elif (Age >= 30) and (Age < 60):
        return "Middle Aged"
    else:
        return "Senior"
df["Age_Category"] = df["Age"].apply(Age_Categorize)
df

  Name  Age Age_Category
0    A   25        Young
1    B   40  Middle Aged
2    C   50  Middle Aged
3    D   75       Senior
4    E   35  Middle Aged

In [298]:
#  sort the dataframe in salary in descending order

df= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Department":["HR","Sales","HR"],"Salary":[50000,60000,40000]})

   ID   Name Department  Salary
0   1   Arun         HR   50000
1   2   Ajay      Sales   60000
2   3  Rahul         HR   40000

In [301]:
df.sort_values(by="Salary", ascending = False)

   ID   Name Department  Salary
1   2   Ajay      Sales   60000
0   1   Arun         HR   50000
2   3  Rahul         HR   40000

In [323]:
df = pd.DataFrame({"Name": ["A","B","C","D","E"],"Age": [25,40,50,75,35]})
def Age_Categorize(Age):
    if Age < 30:
        return "Young"
    elif (Age >= 30) and (Age < 60):
        return "Middle Aged"
    else:
        return "Senior"
df["Age_Category"] = df["Age"].apply(Age_Categorize)
df

  Name  Age Age_Category
0    A   25        Young
1    B   40  Middle Aged
2    C   50  Middle Aged
3    D   75       Senior
4    E   35  Middle Aged

In [338]:
# convert a join_date to date_time format and extract the year

In [327]:
df= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Join_date":["2000-12-25","1996-12-30","2025-08-21"]})
df

   ID   Name   Join_date
0   1   Arun  2000-12-25
1   2   Ajay  1996-12-30
2   3  Rahul  2025-08-21

In [337]:
df["Join_date"] = pd.to_datetime(df["Join_date"])  # convert to datetime format
df

   ID   Name  Join_date
0   1   Arun 2000-12-25
1   2   Ajay 1996-12-30
2   3  Rahul 2025-08-21

In [336]:
df["Join_date"].dt.year # extract year

0    2000
1    1996
2    2025
Name: Join_date, dtype: int32

In [335]:
df["Join_date"].dt.month  # extract month

0    12
1    12
2     8
Name: Join_date, dtype: int32

In [334]:
df["Join_date"].dt.day # extract day

0    25
1    30
2    21
Name: Join_date, dtype: int32

In [333]:
df["Join_date"].dt.weekday  # day of week (0-Mon,1-Tue,...,6-Sun)

0    0
1    0
2    3
Name: Join_date, dtype: int32

In [341]:
df1= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Join_date":["25-12-2000","30-12-1996","21-08-2025"]})
df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format
df1

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\3561264643.py:2: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format

   ID   Name  Join_date
0   1   Arun 2000-12-25
1   2   Ajay 1996-12-30
2   3  Rahul 2025-08-21

In [342]:
df1= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Join_date":["25.12.2000","30.12.1996","21.08.2025"]})
df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format
df1

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\4070051300.py:2: UserWarning: Parsing dates in %d.%m.%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format

   ID   Name  Join_date
0   1   Arun 2000-12-25
1   2   Ajay 1996-12-30
2   3  Rahul 2025-08-21

In [344]:
df1= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Join_date":["25/12/2000","30/12/1996","21/08/2025"]})
df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format
df1

C:\Users\Vishnu Sagar\AppData\Local\Temp\ipykernel_10940\4281523507.py:2: UserWarning: Parsing dates in %d/%m/%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format

   ID   Name  Join_date
0   1   Arun 2000-12-25
1   2   Ajay 1996-12-30
2   3  Rahul 2025-08-21

In [346]:
df1= pd.DataFrame({"ID": [1,2,3],"Name":["Arun","Ajay","Rahul"],"Join_date":["12/25/2000","12/30/1996","08/09/2025"]})
df1["Join_date"] = pd.to_datetime(df1["Join_date"])  # convert to datetime format
df1

   ID   Name  Join_date
0   1   Arun 2000-12-25
1   2   Ajay 1996-12-30
2   3  Rahul 2025-08-09

In [352]:
# find gender wise average salary in each departments

df= pd.DataFrame({"ID": [1,2,3,4,5,6],"Name":["Arun","Ajay","Rahul","Sona","Revathy","Parvathy"],
                  "Department":["HR","Sales","HR","Finance","HR","Sales"],
                  "Salary":[50000,60000,40000,65000,73000,40000],
                 "Gender":["Male","Male","Male","Female","Female","Female"]
                 })
df

   ID      Name Department  Salary  Gender
0   1      Arun         HR   50000    Male
1   2      Ajay      Sales   60000    Male
2   3     Rahul         HR   40000    Male
3   4      Sona    Finance   65000  Female
4   5   Revathy         HR   73000  Female
5   6  Parvathy      Sales   40000  Female

In [351]:
df.groupby(["Department","Gender"])["Salary"].mean()

Department  Gender
Finance     Female    65000.0
HR          Female    73000.0
            Male      45000.0
Sales       Female    40000.0
            Male      60000.0
Name: Salary, dtype: float64

In [356]:
# find the rows with the maximum salary in each department

max_index = df.groupby("Department")["Salary"].idxmax()
df.loc[max_index]

   ID     Name Department  Salary  Gender
3   4     Sona    Finance   65000  Female
4   5  Revathy         HR   73000  Female
1   2     Ajay      Sales   60000    Male

In [358]:
# detect and remove duplicates based on employee ID and name

df= pd.DataFrame({"ID": [1,2,3,1],"Name":["Arun","Ajay","Rahul","Arun"],"Department":["HR","Sales","HR","FInance"],"Salary":[50000,60000,40000,65000]})
df

   ID   Name Department  Salary
0   1   Arun         HR   50000
1   2   Ajay      Sales   60000
2   3  Rahul         HR   40000
3   1   Arun    FInance   65000

In [360]:
df[df.duplicated(subset=["ID","Name"])]

   ID  Name Department  Salary
3   1  Arun    FInance   65000

In [362]:
df.drop_duplicates(subset=["ID","Name"], keep="first")

   ID   Name Department  Salary
0   1   Arun         HR   50000
1   2   Ajay      Sales   60000
2   3  Rahul         HR   40000

## Pivot tables and Crosstabs in Pandas

In pandas, both pivot tables and crosstabs are used for summarizing and analyzing data especilaly for tabular data (like spreadsheets)

A pivot table is a flexible and powerful way to group and summarize data. It allows you to:

1. Aggregate values using functions like sum, mean, count etc.
2. Handle multi-level indexes (hierarchial)
3. fill in missing values

Syntax: df.pivot_table(

             values = "column_to_aggregate",
             index = "row_index",
             columns = "column_index",
             aggfunc = "mean"/"sum"/"count"/etc
             fill_value = 0  # optional
)

#### Pivot table

In [364]:
data = {
    'Department': ['Sales','Sales','HR','HR','IT','IT'],
    'Employee': ['Alice','Bob','Charlie','David','Eve','Frank'],
    'Salary': [50000,55000,40000,42000,60000,62000],
    'Gender': ['F','M','M','M','F','M']
}
df = pd.DataFrame(data)
df

  Department Employee  Salary Gender
0      Sales    Alice   50000      F
1      Sales      Bob   55000      M
2         HR  Charlie   40000      M
3         HR    David   42000      M
4         IT      Eve   60000      F
5         IT    Frank   62000      M

In [365]:
# pivot: average salary by department and gender

df.pivot_table(values = "Salary",index = "Department",columns = "Gender",aggfunc = "mean",fill_value = 0)

Gender            F        M
Department
HR              0.0  41000.0
IT          60000.0  62000.0
Sales       50000.0  55000.0

In [368]:
# pivot by row and sub row

df.pivot_table(values = "Salary",index = ["Department","Employee"],columns = "Gender",aggfunc = "mean",fill_value = 0)

Gender                     F        M
Department Employee
HR         Charlie       0.0  40000.0
           David         0.0  42000.0
IT         Eve       60000.0      0.0
           Frank         0.0  62000.0
Sales      Alice     50000.0      0.0
           Bob           0.0  55000.0

#### crosstab

crosstab is simpler, designed to count occurences of combinations of variables. Its basically a frequency tbale, but can also handle aggregation if needed

Syntax:

pd.crosstab(

         index = df['column1'],
         columns = df['column2'],
         values = df['column3'],
         aggfunc = 'sum',
         normalize = 'index'
)

In [369]:
data = {
    'Department': ['Sales','Sales','HR','HR','IT','IT'],
    'Employee': ['Alice','Bob','Charlie','David','Eve','Frank'],
    'Salary': [50000,55000,40000,42000,60000,62000],
    'Gender': ['F','M','M','M','F','M']
}
df = pd.DataFrame(data)
df

  Department Employee  Salary Gender
0      Sales    Alice   50000      F
1      Sales      Bob   55000      M
2         HR  Charlie   40000      M
3         HR    David   42000      M
4         IT      Eve   60000      F
5         IT    Frank   62000      M

In [370]:
pd.crosstab(df["Department"],df["Gender"])

Gender      F  M
Department
HR          0  2
IT          1  1
Sales       1  1

In [371]:
# with aggregation

# sum of salary per department and gender

pd.crosstab(df["Department"],df["Gender"],values = df["Salary"],aggfunc = "sum")

Gender            F        M
Department
HR              NaN  82000.0
IT          60000.0  62000.0
Sales       50000.0  55000.0

In [378]:
# sum of salary per department and employee and gender

pd.crosstab([df["Department"],df["Employee"]],df["Gender"],values = df["Salary"],aggfunc = "sum")

Gender                     F        M
Department Employee
HR         Charlie       NaN  40000.0
           David         NaN  42000.0
IT         Eve       60000.0      NaN
           Frank         NaN  62000.0
Sales      Alice     50000.0      NaN
           Bob           NaN  55000.0

In [385]:
# count number of employees joined in each year

data = {
    'Department': ['Sales','Sales','HR','HR','IT','IT'],
    'Employee': ['Alice','Bob','Charlie','David','Eve','Frank'],
    'Salary': [50000,55000,40000,42000,60000,62000],
    'Gender': ['F','M','M','M','F','M'],
    'Join_date': ["1996-12-25", "2000-08-30","1996-06-21","2024-09-01","2024-12-05","2010-07-15"]
}
df= pd.DataFrame(data)
df

  Department Employee  Salary Gender   Join_date
0      Sales    Alice   50000      F  1996-12-25
1      Sales      Bob   55000      M  2000-08-30
2         HR  Charlie   40000      M  1996-06-21
3         HR    David   42000      M  2024-09-01
4         IT      Eve   60000      F  2024-12-05
5         IT    Frank   62000      M  2010-07-15

In [387]:
df["Join_date"] = pd.to_datetime(df["Join_date"])
df

  Department Employee  Salary Gender  Join_date
0      Sales    Alice   50000      F 1996-12-25
1      Sales      Bob   55000      M 2000-08-30
2         HR  Charlie   40000      M 1996-06-21
3         HR    David   42000      M 2024-09-01
4         IT      Eve   60000      F 2024-12-05
5         IT    Frank   62000      M 2010-07-15

In [388]:
df["Join_Year"] = df["Join_date"].dt.year

In [389]:
df

  Department Employee  Salary Gender  Join_date  Join_Year
0      Sales    Alice   50000      F 1996-12-25       1996
1      Sales      Bob   55000      M 2000-08-30       2000
2         HR  Charlie   40000      M 1996-06-21       1996
3         HR    David   42000      M 2024-09-01       2024
4         IT      Eve   60000      F 2024-12-05       2024
5         IT    Frank   62000      M 2010-07-15       2010

In [390]:
pd.crosstab(df["Join_Year"],df["Employee"])

Employee   Alice  Bob  Charlie  David  Eve  Frank
Join_Year
1996           1    0        1      0    0      0
2000           0    1        0      0    0      0
2010           0    0        0      0    0      1
2024           0    0        0      1    1      0

In [392]:
df["Join_Year"].value_counts()

Join_Year
1996    2
2024    2
2000    1
2010    1
Name: count, dtype: int64

In [ ]:
# how to merge two dataframes, how to get the top n records by a column
# how to a datetime column and extract parts of it
# how to rename columns
# how to apply a custom function to a column
# how to group data and get aggregate statistics
# how to add a new column to a dataframe
# how to pivot a dataframe
# you have sales data for multiple regions, how would you calculate monthly average sales for each region

In [432]:
# how to merge two dataframes, how to get the top n records by a column

df1 = pd.DataFrame({"ID":[1,2,3,4],"Name":["Alice","Bob","Charlie","Don"]})
df2 = pd.DataFrame({"ID":[1,3,4,5],"Score":[90,85,80,75]})
pd.merge(df1,df2,on="ID").sort_values(by="Score").head(2)

   ID     Name  Score
2   4      Don     80
1   3  Charlie     85

In [407]:
# how to a datetime column and extract parts of it

df = pd.DataFrame({"EMployee ID":[1,2,3,4],"Name":["Alice","Bob","Charlie","Don"],"DOJ":["2000-12-09","2005-04-14","2010-07-01","2012-11-25"]})
df["DOJ"] = pd.to_datetime(df["DOJ"])
print(df["DOJ"].dt.year)
print(df["DOJ"].dt.month)
print(df["DOJ"].dt.day)
print(df["DOJ"].dt.weekday)

0    2000
1    2005
2    2010
3    2012
Name: DOJ, dtype: int32
0    12
1     4
2     7
3    11
Name: DOJ, dtype: int32
0     9
1    14
2     1
3    25
Name: DOJ, dtype: int32
0    5
1    3
2    3
3    6
Name: DOJ, dtype: int32

In [410]:
# how to rename columns

df = pd.DataFrame({"Employee ID":[1,2,3,4],"Name":["Alice","Bob","Charlie","Don"],"DOJ":["2000-12-09","2005-04-14","2010-07-01","2012-11-25"]})
df_renamed = df.rename(columns={"DOJ":"Date_of_joining"})
df_renamed

   Employee ID     Name Date_of_joining
0            1    Alice      2000-12-09
1            2      Bob      2005-04-14
2            3  Charlie      2010-07-01
3            4      Don      2012-11-25

In [430]:
# how to apply a custom function to a column

df= pd.DataFrame({"Model":["HP","Dell","Lenovo","Acer"],"Price":[55000,80000,65000,25000]})
df
def Categorize(price):
    if price <= 30000:
        return "Cheap"
    elif (price > 3000) and (price<=60000):
        return "Affordable"
    else:
        return "Expensive"
Categorize(50000)

print(df["Price"].apply(Categorize))
df["Price_Category"] = df["Price"].apply(Categorize)
df

0    Affordable
1     Expensive
2     Expensive
3         Cheap
Name: Price, dtype: object

    Model  Price Price_Category
0      HP  55000     Affordable
1    Dell  80000      Expensive
2  Lenovo  65000      Expensive
3    Acer  25000          Cheap

In [413]:
# how to group data and get aggregate statistics

df = pd.DataFrame({"Department":["HR","Sales","Marketing","HR","Sales"],"Name":["Arun","Ajay","Bob","Don","Sneha"],"Salary":[35000,50000,45000,70000,30000]})
df.groupby("Department")["Salary"].agg(["sum","max"])

               sum    max
Department
HR          105000  70000
Marketing    45000  45000
Sales        80000  50000

In [416]:
# how to add a new column to a dataframe

df = pd.DataFrame({"Department":["HR","Sales","Marketing"],"Count_of_Employees":[12,30,45],"Salary":[35000,50000,45000]})
df["Total_Salary"] = df["Count_of_Employees"]*df["Salary"]
df

  Department  Count_of_Employees  Salary  Total_Salary
0         HR                  12   35000        420000
1      Sales                  30   50000       1500000
2  Marketing                  45   45000       2025000

In [417]:
# how to pivot a dataframe

df = pd.DataFrame({"Department":["HR","Sales","Marketing","HR","Sales"],"Name":["Arun","Ajay","Bob","Don","Sneha"],"Salary":[35000,50000,45000,70000,30000]})
df.pivot_table(values="Salary",index="Department",columns="Name",aggfunc="mean")

Name           Ajay     Arun      Bob      Don    Sneha
Department
HR              NaN  35000.0      NaN  70000.0      NaN
Marketing       NaN      NaN  45000.0      NaN      NaN
Sales       50000.0      NaN      NaN      NaN  30000.0

In [422]:
# you have sales data for multiple regions, how would you calculate monthly average sales for each region

df = pd.DataFrame({"Region":["Zone A","Zone B","Zone C","Zone D","Zone B","Zone A","Zone D","Zone C"],
                   "Month":["Jan","Mar","Dec","June","Feb","July","Dec","Jan"],
                   "Sales":[50000,70000,65000,80000,41000,45000,90000,67000]})
df.pivot_table(values="Sales",index="Region",columns="Month",aggfunc="mean")

Month       Dec      Feb      Jan     July     June      Mar
Region
Zone A      NaN      NaN  50000.0  45000.0      NaN      NaN
Zone B      NaN  41000.0      NaN      NaN      NaN  70000.0
Zone C  65000.0      NaN  67000.0      NaN      NaN      NaN
Zone D  90000.0      NaN      NaN      NaN  80000.0      NaN